Revit 2024 API
DocumentPreviewSettings Properties
The DocumentPreviewSettings type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
IsViewUpdateForced
 Identifies if Revit will update the preview view if necessary.
PreviewViewId
 The view id that will be used to generate the preview.
See Also
DocumentPreviewSettings Class
Autodesk.Revit.DB Namespace